app/controllers/consults_controller.rb

  def index
    @consults = Consult.all
---
SELECT "consults".* FROM "consults"

  def create
    @consult = Consult.new(consult_params)

    respond_to do |format|
      if @consult.save
---
INSERT INTO "consults" ("Name", "Wedding_Date", "Getting_Ready_Location", "Service_Type", "Number_of_Services", "Comments", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_consult
      @consult = Consult.find(params[:id])
---
SELECT  "consults".* FROM "consults" WHERE "consults"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]