app/controllers/pictures_controller.rb

  def create
    @picture = Picture.new(picture_params)

    respond_to do |format|
      if @picture.save
---
INSERT INTO "pictures" ("Image", "Name", "Type", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["Image", "barn.jpg"], ["Name", ""], ["Type", ""], ["created_at", "2019-05-02 19:17:57.967590"], ["updated_at", "2019-05-02 19:17:57.967590"]]